import pandas as pd

india_weather = pd.DataFrame({
    
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
    
})

india_weather

In [5]:
us_weather = pd.DataFrame({
    
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
    
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### concat dataframe

In [8]:
# In concat function we can pass multiple dataframe
df = pd.concat([india_weather,us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### use ignore_index to get continuous index

In [9]:
df = pd.concat([india_weather,us_weather], ignore_index = True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [10]:
#pass key to concat
#it will make additional index
#and we can easily access data through this keys
#it is usefull when we merge a big dataframe

df = pd.concat([india_weather,us_weather],keys=["india",'us'] )
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [11]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

## Append data frame to column
here merge would be more helpful to add a new column

In [20]:
temperature_Data=pd.DataFrame({ 
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
},index=[0,1,2])

temperature_Data

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [21]:
windspeed_Data=pd.DataFrame({ 
    "city":["delhi","mumbai","banglore"],
    "windspeed":[7,12,9]
},index=[1,0,2])
windspeed_Data

       city  windspeed
1     delhi          7
0    mumbai         12
2  banglore          9

In [22]:
#by default axis = 0 which is row
#sort according to index
pd.concat([temperature_Data,windspeed_Data], axis=1)

       city  temperature      city  windspeed
0    mumbai           32    mumbai         12
1     delhi           45     delhi          7
2  banglore           30  banglore          9

### Append series to dataframe

In [23]:
s = pd.Series(['Humid','Dry','Rain'], name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df =pd.concat([temperature_Data,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain